## Production: cloudwatch_alarms

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  

**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
aws_cloudwatch_metric_alarm.metrics_api_gateway_400_errors_above_threshold: Refreshing state... [id=metrics-api-gateway-400-errors-above-threshold]
aws_cloudwatch_metric_alarm.metrics_api_gateway_traffic_anomaly[0]: Refreshing state... [id=metrics-api-gateway-traffic-anomaly]
aws_cloudwatch_metric_alarm.metrics_api_gateway_max_invocations_threshold[0]: Refreshing state... [id=metrics-api-gateway-above-maximum-invocations]
aws_cloudwatch_metric_alarm.metrics_api_gateway_500_errors_above_threshold: Refreshing state... [id=metrics-api-gateway-500-errors-above-threshold]
aws_cloudwatch_metric_alarm.metrics_api_gateway_min_invocations_threshold: Refreshing state... [id=metrics-api-gateway-below-minimum-invocations]
aws_cloudwatch_metric_alarm.metrics_api_gateway_max_latency_threshold: Refreshing state... [id=metrics-api-gateway-above-maximum-latency]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.metrics_api_gateway_400_errors_above_threshold will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "metrics_api_gateway_400_errors_above_threshold" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:820252213580:alert-critical",
        ] -> null
      - alarm_description         = "This metric monitors 400 errors in the metrics API gateway" -> null
      - alarm_name                = "metrics-api-gateway-400-errors-above-threshold" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:820252213580:alarm:metrics-api-gateway-400-errors-above-threshold" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "ApiName" = "save-metrics"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "metrics-api-gateway-400-errors-above-threshold" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "4XXError" -> null
      - namespace                 = "AWS/ApiGateway" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 3000 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.metrics_api_gateway_500_errors_above_threshold must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "metrics_api_gateway_500_errors_above_threshold" {
      ~ alarm_name                            = "metrics-api-gateway-500-errors-above-threshold" -> "metrics-api-gateway-errors-above-threshold" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:820252213580:alarm:metrics-api-gateway-500-errors-above-threshold" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "metrics-api-gateway-500-errors-above-threshold" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.metrics_api_gateway_traffic_anomaly[0] will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "metrics_api_gateway_traffic_anomaly" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:820252213580:alert-critical",
        ] -> null
      - alarm_description         = "This metric monitors for significant changes in API gateway traffic" -> null
      - alarm_name                = "metrics-api-gateway-traffic-anomaly" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:820252213580:alarm:metrics-api-gateway-traffic-anomaly" -> null
      - comparison_operator       = "LessThanLowerOrGreaterThanUpperThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "metrics-api-gateway-traffic-anomaly" -> null
      - insufficient_data_actions = [] -> null
      - ok_actions                = [] -> null
      - period                    = 0 -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0 -> null
      - threshold_metric_id       = "daily_count_expected" -> null
      - treat_missing_data        = "missing" -> null

      - metric_query {
          - id          = "daily_count" -> null
          - return_data = true -> null

          - metric {
              - dimensions  = {
                  - "ApiName" = "save-metrics"
                } -> null
              - metric_name = "Count" -> null
              - namespace   = "AWS/ApiGateway" -> null
              - period      = 86400 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
      - metric_query {
          - expression  = "ANOMALY_DETECTION_BAND(daily_count)" -> null
          - id          = "daily_count_expected" -> null
          - label       = "Daily API requests (Expected)" -> null
          - return_data = true -> null
        }
    }

Plan: 1 to add, 0 to change, 3 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"

Releasing state lock. This may take a few moments...
```
</details>